argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      if(xQueueSend(buttonQueueHandle, (uint8_t*)&buttonState, 0) == pdTRUE)
      {
        cli_printf("[Queue] HW -> Model (%d)\r\n", buttonState);
      }
    }
    
    osDelay(100);
  }
  /* USER CODE END StartButtonTask */
}

/* USER CODE BEGIN Header_StartLEDTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLEDTask */
void StartLEDTask(void const * argument)
{
  /* USER CODE BEGIN StartLEDTask */
  
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);
      
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
      
      cli_printf("[Queue] Model -> HW (led = %d)\r\n", led_state);
    }
    
    osDelay(20);
  }
  /* USER CODE END StartLEDTask */
}

/* USER CODE BEGIN Header_StartSDTask */
/**
* @brief Function implementing the sdTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{ 
  /* USER CODE BEGIN StartSDTask */
  
  FRESULT fr;                                               /* FatFs function common result code */
  uint32_t byteswritten, bytesread = 0;                     /* File write/read counts */
  uint8_t wtext[] = "This is STM32 working with FatFs\r\n"; /* File write buffer */
  uint8_t rtext[100];                                       /* File read buffer */
  uint32_t rng_value = 0;
  uint8_t file_name_buff[16];
  
  /* init code for FATFS */
  MX_FATFS_Init();  

  /* Start filename */
  strcpy((char*)file_name_buff, "filenn.TXT");
    
  cli_printf("FATFS %s\r\n", "Start");
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  // if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {  
    /*##-2- Register the file system object to the FatFs module ##############*/
    fr = f_mount(&SDFatFs, (TCHAR const*)SDPath, 0);
    cli_printf("f_mount: %d\r\n", fr);
    if(fr != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
#if 0      
      /*##-3- Create a FAT file system (format) on the logical drive #########*/
      /* WARNING: Formatting the uSD card will delete all content on the device */
      fr = f_mkfs((TCHAR const*)SDPath, FM_ANY, 0, workBuffer, sizeof(workBuffer));
      cli_printf("f_mkfs: %d\r\n", fr);
      if(fr != FR_OK)
      {
        /* FatFs Format Error */
        Error_Handler();
      }
      else
#endif
      {
        HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);
        file_name_buff[4] = '0' + (uint8_t)(rng_value % 10);
        
        /* 10 - 99 files
        HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);
        file_name_buff[5] = '0' + (uint8_t)(rng_value % 10);
        */
        
        cli_printf("file_name_buff: %s\r\n", file_name_buff);

        /*##-4- Create and Open a new text file object with write access #####*/
        fr = f_open(&MyFile, (char*)file_name_buff, FA_OPEN_ALWAYS | FA_WRITE);
        cli_printf("f_open: %d\r\n", fr);
        if(fr != FR_OK)
        {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
        }
        else
        {
#if 1
          /*##-5- Prepare to append data to the text file ################################*/
          fr = f_lseek(&MyFile, f_size(&MyFile));
          cli_printf("f_lseek: %d\r\n", fr);

          if((byteswritten == 0) || (fr != FR_OK))
          {
            /* 'STM32.TXT' file Write or EOF Error */
            Error_Handler();
          }
          else
#endif
          {
            /*##-5- Write data to the text file ################################*/
            fr = f_write(&MyFile, wtext, sizeof(wtext), (UINT *)&byteswritten);
            cli_printf("f_write: %d (%d bytes)\r\n", fr, byteswritten);
            if((byteswritten == 0) || (fr != FR_OK))
            {
              /* 'STM32.TXT' file Write or EOF Error */
              Error_Handler();
            }
            else
            {
              /*##-6- Close the open text file #################################*/
              fr = f_close(&MyFile);
              cli_printf("f_close: %d\r\n", fr);
              
              /*##-7- Open the text file object with read access ###############*/
              fr = f_open(&MyFile, (char*)file_name_buff, FA_READ);
              cli_printf("f_open: %d\r\n", fr);
              if(fr != FR_OK)
              {
                /* 'STM32.TXT' file Open for read Error */
                Error_Handler();
              }
              else
              {
                /*##-8- Read data from the text file ###########################*/
                fr = f_read(&MyFile, rtext, sizeof(rtext), (UINT*)&bytesread);
                cli_printf("f_read: %d\r\n", fr);
                if((bytesread == 0) || (fr != FR_OK))
                {
                  /* 'STM32.TXT' file Read or EOF Error */
                  Error_Handler();
                }
                else
                { 
                  /*##-10- Compare read data with the expected data ############*/
                  if ((bytesread != byteswritten))
                  {                
                    /* Read data is different from the expected data */
                    Error_Handler();
                  }
                  else
                  {
                      cli_printf("FATFS %s\r\n", "Success");
                  }
                }
              }
            }
          }
          
          /*##-6- Close the open text file #################################*/
          fr = f_close(&MyFile);
          cli_printf("f_close: %d\r\n", fr);
        }
      }
      
      /*##-11 - Scan files in the device ###############################*/
      strcpy((char*)rtext, "/");
      rtext[2] = 0x00;
      fr = scan_files((char*)rtext);
      cli_printf("scan_files: %d\r\n", fr);
    }
  }
  
