argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*##-12 - Scan files in the device ###############################*/
  fr = get_free_clusters(&SDFatFs);

  /*##-13- Unlink the micro SD disk I/O driver ###############################*/
  cli_printf("FATFS %s\r\n", "End");
  FATFS_UnLinkDriver(SDPath);
  
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_StartLWIPTask */
/**
* @brief Function implementing the lwipTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLWIPTask */
void StartLWIPTask(void const * argument)
{
  /* USER CODE BEGIN StartLWIPTask */
  struct netconn *conn, *newconn;
  err_t err, accept_err;
  uint8_t data = 0;
  uint8_t iptxt[20];
  struct dhcp *dhcp;

  /* init code for LWIP */
  MX_LWIP_Init();
  
  cli_printf ("State: Looking for DHCP server ...\r\n");

  /* Print network interface status */
  print_netif_status(&gnetif);

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(lwipQueueHandle, &data, 0) == pdTRUE)
    {
      cli_printf("[Queue] Model -> %s (data = %u)\r\n", __func__, data);

      /* Create a new TCP connection handle */
      conn = netconn_new(NETCONN_TCP);

      if (conn!= NULL)
      {
        cli_printf("netconn_new : OK\r\n");
      }
      else
      {
        cli_printf("netconn_new : ERR\r\n");
      }

      /* Delete TCP connection */
      netconn_delete(conn);      
    }
    
    if (dhcp_supplied_address(&gnetif)) 
    {       
      sprintf((char *)iptxt, "%s", ip4addr_ntoa((const ip4_addr_t *)&gnetif.ip_addr));   
      cli_printf("IP address assigned by a DHCP server: %s\r\n", iptxt);
    }
    else
    {
      dhcp = (struct dhcp *)netif_get_client_data(&gnetif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
      cli_printf("DHCP state: %d\r\n", dhcp->state);
      cli_printf("DHCP retries: %d\r\n", dhcp->tries);
      if (dhcp->tries > 4)
      {
        cli_printf("DHCP Timeout !! \r\n");
        dhcp_stop(&gnetif);
      }
    }
    
    osDelay(100);
  }
  /* USER CODE END StartLWIPTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
